//zadatak:
//Na klik dugmeta (class='dugme') zameniti text koji se nalazi u <code> tagovima
//sa odgovarajucim textom iz objekata.
//Napisati funkciju koja menja sadrzaj, na nacin da je ceo kod
//napisan u okviru IIFE (zajedno sa dole napisanim objektima)
//Zameniti boju pozadine svakog container taga sa dole ponudjenim bojama.
var headerContent = {
    text: "је једноставно модел текста који се користи у штампарској и словослагачкој индустрији. Lorem ipsum је био стандард за модел текста још од 1500. године, када је непознати штампар узео кутију са словима и сложио их како би направио узорак књиге. Не само што је овај модел опстао пет векова, него је чак почео да се користи и у електронским медијима, непроменивши се. Популаризован је шездесетих година двадесетог века заједно са листовима летерсета који су садржали Lorem Ipsum пасусе, а данас са софтверским пакетом за прелом као што је Aldus PageMaker који је садржао Lorem Ipsum верзије.",
    color: "deepskyblue"
}

var asideContent = {
    text: "Постоји много верзија и варијација Lorem Ipsum пасуса, али већина је претрпела некакву промену, било да је то додавање неког хумора или насумична респодела речи која на крају не изгледа уверљиво. Ако планирате да користите пасусе Lorem Ipsum модела, требало би да будете сигурни да се у средини текста не крије нека сакривена или срамотна порука. Сви Lorem Ipsum генератори који се могу наћи на Интернету су направљени да понављају предходно дефинисане делове, што чини овај генератор првим правим на Интернету. Он користи речник од 200 латинских речи које су комбиноване са подоста шаблона реченица како би генерисао Lorem Ipsum који изгледа уверљиво. То значи да овде генерисани Lorem Ipsum не садржи понављање, нема убачен хумор или неке неочекиване речи и тако даље.",
    color: "turquoise"
}

var sectionContent = {
    text: "Стефан, наш заједнички пријатељ ме је замолио да пројектујем и имплементирам једну мању рачунарску мрежу за фирму чији је власник наш човек из Шведске. Одмах сам се сетио Милана - идеалан посао за њега! Може да ради прековремено, не треба му специјалан уговор - а након завршеног посла - имаће лепу референцу.",
    color: "violet"
}

var footerContent = {
    text: "Милан је дошао у заказано време на састанак. Слушао ме пажљиво, али већ на самом почетку ми је била сумњива његова неверица и чудна нервоза, коју је нескривено показивао током мог излагања. ",
    color: "beige"
}